/**************************************************************************
*               КАФЕДРА №304 2 КУРС ООП ЛАБОРАТОРНАЯ РАБОТА               *
***************************************************************************
*Project type :Win64 Console Application                                  *
*Project name :LW.sin					         			              *
*File name    :LW.cpp                                                     *
*Language     :C++                                                        *
*Programmers  :Плоцкий Богдан Андреевич     М3О-211Б-21      		      *
*Modified By  :Плоцкий Богдан Андреевич     М3О-211Б-21                   *
*Created      :21.04.2023                                                 *
*Last revision:22.04.2023                                                 *
*Comments	  :ПРОСТЕЙШАЯ ИЕРАРХИЯ КЛАССОВ                                *
**************************************************************************/

#pragma once                  
#include <windows.h>
#include <conio.h>
#include <iostream>    
#include "Header.h"

using namespace std;           // Пространство имен std

/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
/*   Г Л О Б А Л Ь Н Ы Е   П Е Р Е М Е Н Н Ы Е  И  К О Н С Т А Н Т Ы   */
/*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/

HDC hdc;// Объявим контекст устройства
// Контекст устройства по сути это структура,
// содержащая описание видеокарты на вашем компьютере
// и всех необходимых графических элементов

/*---------------------------------------------------------------------*/
/*               П Р О Т О Т И П Ы    Ф У Н К Ц И Й                    */
/*---------------------------------------------------------------------*/
HWND GetConcolWindow(); //указатель на консольное окно
void PressKey(int VkCode); //ждет нажатия кнопки
/***********************************************************************/
/*               О С Н О В Н А Я    П Р О Г Р А М М А                  */
/***********************************************************************/
void main()
{
	//объявление и инициализация переменных
	int x0 = 200;	//стартовые координаты точки
	int y0 = 250;

	//получим дескриптор консольного окна
	HWND hwnd = GetConcolWindow();

	//если дескриптор существует
	if (hwnd != NULL)
	{
		//получим контекст устройства для консольного окна
		hdc = GetWindowDC(hwnd);

		//если контекст существует - можем работать
		if (hdc != 0)
		{
			Point APoint(x0, y0);//точка
			APoint.Show();//показываем точку

			PressKey(49);//1
			APoint.MoveTo(x0 + 100, y0 + 100);//перемещение точки

			PressKey(50);//2
			APoint.Hide();//убираем точку

			PressKey(51);//3
			Aircraft Samolet(x0, y0);// создание самолета
			Samolet.Show(); //показываем 

			PressKey(52);//4
			Samolet.MoveTo(x0 + 100, y0 + 100);//перемещаем 

			PressKey(53);//5
			Samolet.Hide();//убираем 

			// переход в режим перетаскивания
			PressKey(54); //6
			Samolet.Drag();

		}//end if
	}//end if
}//end main()


/*---------------------------------------------------------------------*/
/*               Р Е А Л И З А Ц И Я   Ф У Н К Ц И Й                   */
/*---------------------------------------------------------------------*/

/*----------------------------------------------------------------------*/
/*  Создать консольное окно  */
/*---------------------------*/
HWND GetConcolWindow()
{
	char str[128];
	// char title[128]="xxxxxxxxxxxxxxxxxx";
	LPWSTR title = (LPWSTR)"xxxxxxxxxxxxxxxxxx";	//новая версия Windows
	GetConsoleTitle((LPWSTR)str, sizeof((LPWSTR)str)); // получить заголовок окна
	SetConsoleTitle(title);						// установить новый заголовок окна
	Sleep(100);									// ждем смены заголовка окна (100 мс);

	HWND hwnd = FindWindow(NULL, (LPWSTR)title);// определяем дескриптор окна
	SetConsoleTitle((LPWSTR)str);				//возвращаем прежний заголовок

	return hwnd;//вернуть дескриптор окна
}//end GetConcolWindow()


//функция паузы до нажатия кнопки
void PressKey(int VkCode)
{
	while (1)
		if (KEY_DOWN(VkCode))
			break;
}
